--liquibase formatted sql
--changeset ivantolkach:003-filling-admin-and-user
--comment Начальное создание SUPER администратора, а также студентов для тестирования программы

INSERT INTO users.admin(id, sname, fname, mname, email, password, phone_number, role, is_active)
VALUES
    ('e1cb5ed2-6850-4766-be54-75a8474cfb7c', 'Толкач', 'Иван', 'Вячеславович', 'barin@bntu.by', '$2a$12$KUH7ZNm03PMeY/OggsB2wOAIvyTwPlZmHPolNYp5SJ7i5kym2o8du', '+375291234567', 1, true);

INSERT INTO users.student(id, sname, fname, mname, faculty_id, group_number, gender, age, residence)
VALUES
    ('d122cdbd-36f1-4017-9b40-46729716980f', 'Бульбочка', 'Вячеслав', 'Дмитриевич', '00000000-0000-0000-0000-000000000007', 10701122,'MALE', 20, 'Общежитие'),
    ('06684181-5f21-4d2f-a7e9-0ec7e8b1b92b', 'Киянко', 'Максим', 'Витальевич', '00000000-0000-0000-0000-000000000007', 10701122,'MALE', 21, 'Общежитие'),
    ('0fe54f9b-d33d-4b7d-b8dc-98931c0e36a7', 'Шамаев', 'Ян', 'Иванович', '00000000-0000-0000-0000-000000000007', 10701122,'MALE', 21, 'Общежитие'),
    ('8a897069-2d5a-40c3-a0a1-455e34571ca1', 'Карташов', 'Тимофей', 'Александрович', '00000000-0000-0000-0000-000000000007', 10701222,'MALE', 20, 'С родителями'),
    ('a2a2119b-3da3-4a55-98f3-931683d2663a', 'Черногоров', 'Михаил', 'Сергеевич', '00000000-0000-0000-0000-000000000007', 10701222,'MALE', 20, 'С родителями'),
    ('fe318ea8-0bda-4b2e-b0a6-1c444205a663', 'Кузьмич', 'Ярослав', 'Валерьевич', '00000000-0000-0000-0000-000000000007', 10701322,'MALE', 20, 'С родителями'),
    ('b752c191-a856-4f7b-8138-cfa599db274d', 'Бабенко', 'Максим', 'Игоревич', '00000000-0000-0000-0000-000000000007', 10701322,'MALE', 21, 'С родителями'),
    ('1ad3c035-d337-461e-94bb-f7720b1e7ed0', 'Антонюк', 'Артём', 'Максимович', '00000000-0000-0000-0000-000000000005', 10502224,'MALE', 19, 'С родителями'),
    ('8e3182e9-7476-487a-92d5-28cef9e36cee', 'Лиза', 'Пурр', 'Дмитриевна', '00000000-0000-0000-0000-000000000005', 10502323,'FEMALE', 20, 'Общежитие'),
    ('206295cc-6a3e-43df-9361-d495722a8fbd', 'Алексей', 'Мамонт', 'Валерьевич', '00000000-0000-0000-0000-000000000012', 11205124,'MALE', 19, 'Съёмное жильё'),
    ('caed8a7c-2d0e-4dc7-ae73-aa5a593d9e73', 'Мурза', 'Денис', 'Андреевич', '00000000-0000-0000-0000-000000000005', 11205122,'MALE', 21, 'С родителями');

--rollback DELETE FROM users.student
--rollback WHERE id IN (
--rollback   'd122cdbd-36f1-4017-9b40-46729716980f'
--rollback   '06684181-5f21-4d2f-a7e9-0ec7e8b1b92b',
--rollback   '8e3182e9-7476-487a-92d5-28cef9e36cee',
--rollback   '206295cc-6a3e-43df-9361-d495722a8fbd'
--rollback   '0fe54f9b-d33d-4b7d-b8dc-98931c0e36a7',
--rollback   '8a897069-2d5a-40c3-a0a1-455e34571ca1',
--rollback   'a2a2119b-3da3-4a55-98f3-931683d2663a',
--rollback   'fe318ea8-0bda-4b2e-b0a6-1c444205a663',
--rollback   'b752c191-a856-4f7b-8138-cfa599db274d',
--rollback   '1ad3c035-d337-461e-94bb-f7720b1e7ed0'
--rollback   );
--rollback DELETE FROM users.admin
--rollback WHERE id IN (
--rollback   'e1cb5ed2-6850-4766-be54-75a8474cfb7c'
--rollback   );
